In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [5]:
df

        one       two     three
a  1.033985 -1.055726       NaN
b -0.845544  0.371457  0.823819
c  0.225663  1.687670 -0.060496
d       NaN  0.324499  0.771091

In [6]:
row = df.iloc[1]

In [7]:
row

one     -0.845544
two      0.371457
three    0.823819
Name: b, dtype: float64

In [9]:
column = df['two']

In [10]:
column

a   -1.055726
b    0.371457
c    1.687670
d    0.324499
Name: two, dtype: float64

In [11]:
df.sub(row, axis='columns')

        one       two     three
a  1.879529 -1.427183       NaN
b  0.000000  0.000000  0.000000
c  1.071207  1.316213 -0.884315
d       NaN -0.046958 -0.052728

In [12]:
df.sub(row, axis=1)

        one       two     three
a  1.879529 -1.427183       NaN
b  0.000000  0.000000  0.000000
c  1.071207  1.316213 -0.884315
d       NaN -0.046958 -0.052728

In [13]:
df.sub(column, axis='index')

        one  two     three
a  2.089711  0.0       NaN
b -1.217001  0.0  0.452362
c -1.462007  0.0 -1.748166
d       NaN  0.0  0.446592

In [14]:
df.sub(column, axis=0)

        one  two     three
a  2.089711  0.0       NaN
b -1.217001  0.0  0.452362
c -1.462007  0.0 -1.748166
d       NaN  0.0  0.446592

In [20]:
dfmi = df.copy()

In [21]:
dfmi

        one       two     three
a  1.033985 -1.055726       NaN
b -0.845544  0.371457  0.823819
c  0.225663  1.687670 -0.060496
d       NaN  0.324499  0.771091

In [22]:
dfmi.index = pd.MultiIndex.from_tuples([(1, 'a'), (1, 'b'),(1, 'c'), (2, 'a')],names=['first', 'second'])

In [23]:
dfmi

                   one       two     three
first second
1     a       1.033985 -1.055726       NaN
      b      -0.845544  0.371457  0.823819
      c       0.225663  1.687670 -0.060496
2     a            NaN  0.324499  0.771091

In [17]:
dfmi.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a')],
           names=['first', 'second'])

In [18]:
dfmi.sub(column, axis=0, level='second')

                   one       two     three
first second
1     a       2.089711  0.000000       NaN
      b      -1.217001  0.000000  0.452362
      c      -1.462007  0.000000 -1.748166
2     a            NaN  1.380225  1.826817